<!DOCTYPE html>
<html lang="fr">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width,initial-scale=1" />
<title>Politique de confidentialité — SquirrelVault Tracker</title>
<meta name="description" content="Politique de confidentialité de SquirrelVault Tracker." />
<link rel="icon" type="image/png" href="./squirrelvault-icon.png" />
<link rel="apple-touch-icon" href="./squirrelvault-icon.png" />
<meta property="og:title" content="Politique de confidentialité — SquirrelVault Tracker" />
<meta property="og:description" content="Comment nous traitons vos données : informations de compte, stockage cloud pour les articles/notes, traitement OCR par scan IA, aucune publicité, aucune vente de données." />
<meta property="og:image" content="https://squirrel-app.github.io/SquirrelVault-Tracker-Support/squirrelvault-icon.png" />
<meta property="og:type" content="website" />
<meta name="twitter:card" content="summary_large_image" />
<style>

  :root {
    --bg: #FFF7EF;
    --fg: #2B2B2B;
    --muted: #6B6B6B;
    --card: #FFFFFF;
    --border: #F2E6DA;
    --accent: #FFA74A;
    --accent-strong: #FF8C1F;
    --link: var(--accent);
    --shadow: 0 6px 24px rgba(255,140,31,.15);
    --radius: 18px;
  }
  @media (prefers-color-scheme: dark) {
    :root {
      --bg: #19130E;
      --fg: #EFE9E3;
      --muted: #B7ADA6;
      --card: #231A13;
      --border: #3B2C20;
      --accent: #FF9E3A;
      --accent-strong: #FFB25E;
      --link: var(--accent);
      --shadow: 0 8px 28px rgba(255,158,58,.18);
    }
  }
  * { box-sizing: border-box; }
  html { scroll-behavior: smooth; }
  body { margin: 0; font: 16px/1.65 system-ui,-apple-system,Segoe UI,Inter,Roboto,Arial,sans-serif; background: var(--bg); color: var(--fg); }
  .wrap { max-width: 960px; margin: 0 auto; padding: 40px 20px 80px; }
  header { margin-bottom: 24px; }
  .brand { display: flex; align-items: center; gap: 12px; margin-bottom: 10px; }
  .logo {
    width: 40px; height: 40px; border-radius: 12px;
    background: linear-gradient(135deg, var(--accent), var(--accent-strong));
    box-shadow: var(--shadow);
    display: flex; align-items: center; justify-content: center;
    color: white; font-weight: 800; font-size: 18px; letter-spacing: .5px;
    overflow: hidden;
  }
  .logo img { width: 100%; height: 100%; border-radius: 12px; }
  h1 { font-size: 1.9rem; margin: 0; }
  .sub { color: var(--muted); font-size: .95rem; margin-top: 6px; }
  nav.toc a { display: inline-block; margin: 4px 12px 4px 0; color: var(--link); text-decoration: none; padding:6px 10px; border:1px solid var(--border); border-radius:999px; }
  nav.toc a:hover { text-decoration: none; background: rgba(0,0,0,.03); }
  .card {
    background: var(--card);
    border: 1px solid var(--border);
    border-radius: var(--radius);
    box-shadow: var(--shadow);
    padding: 22px;
    margin: 18px 0;
  }
  h2 { font-size: 1.25rem; margin: 26px 0 10px; }
  h3 { font-size: 1.05rem; margin: 22px 0 10px; }
  a { color: var(--link); text-decoration: none; }
  a:hover { text-decoration: underline; }
  ul { padding-left: 20px; }
  details summary { cursor: pointer; font-weight: 700; }
  .grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(280px, 1fr)); gap: 16px; }
  .btn { display:inline-block; padding:10px 14px; border-radius:12px; border:1px solid var(--border); text-decoration:none; background: var(--card); }
  .btn:hover { background: rgba(0,0,0,.03); }
  footer { margin-top: 36px; color: var(--muted); font-size: .9rem; display:flex; gap:12px; flex-wrap:wrap; align-items:center; }
  .pill { border:1px solid var(--border); border-radius:999px; padding:6px 10px; }
  :target { outline: 2px solid var(--accent); outline-offset: 6px; border-radius: 14px; }

  .lang-bar { display: flex; gap: 6px; flex-wrap: wrap; align-items: center; margin-top: 8px; font-size: .85rem; }
  .lang-bar a, .lang-bar strong { padding: 3px 8px; border: 1px solid var(--border); border-radius: 999px; color: var(--link); text-decoration: none; }
  .lang-bar strong { background: var(--accent); color: #fff; border-color: var(--accent); }
  .lang-bar a:hover { background: rgba(0,0,0,.03); text-decoration: none; }

</style>
</head>
<body>
<main class="wrap">
  <header>
    <div class="brand">
      <div class="logo"><img src="squirrelvault-icon.png" alt="SquirrelVault Tracker logo"></div>
      <div>
        <h1>Politique de confidentialit&eacute;</h1>
        <div class="sub">Mise &agrave; jour le <time datetime="2026-02-23">23 f&eacute;v. 2026</time></div>
      </div>
    </div>
    <nav class="toc">
      <a href="./index.html">&larr; Retour au support</a>
      <a href="#summary">R&eacute;sum&eacute;</a>
      <a href="#data">Donn&eacute;es collect&eacute;es</a>
      <a href="#use">Utilisation des donn&eacute;es</a>
      <a href="#sharing">Partage</a>
      <a href="#rights">Vos droits</a>
      <a href="#contact">Contact</a>
    </nav>
    <div class="lang-bar">
      <a href="./privacy.html">EN</a>
      <a href="./privacy-de.html">DE</a>
      <a href="./privacy-es.html">ES</a>
      <strong>FR</strong>
      <a href="./privacy-it.html">IT</a>
      <a href="./privacy-nl.html">NL</a>
      <a href="./privacy-pl.html">PL</a>
      <a href="./privacy-pt.html">PT</a>
      <a href="./privacy-uk.html">UK</a>
    </div>
  </header>

  <section id="summary" class="card">
    <h2>R&eacute;sum&eacute;</h2>
    <ul>
      <li>Nous collectons le minimum d'informations de compte aupr&egrave;s de votre fournisseur de connexion (Google, Apple ou Facebook) : adresse e-mail, nom d'affichage, avatar (le cas &eacute;ch&eacute;ant) et un identifiant technique de compte.</li>
      <li>Vos donn&eacute;es d'inventaire (articles) et notes, ainsi que les cat&eacute;gories/groupes, peuvent &ecirc;tre stock&eacute;es dans le cloud (Firebase Firestore) pour prendre en charge les fonctionnalit&eacute;s li&eacute;es au compte.</li>
      <li>Si vous utilisez le scan IA, nous traitons le texte reconnu (OCR) pour g&eacute;n&eacute;rer des suggestions de remplissage automatique. L'application ne t&eacute;l&eacute;verse pas vos photos dans le cadre du scan IA.</li>
      <li>Aucune publicit&eacute; et aucune vente de donn&eacute;es. Nous ne partageons pas vos donn&eacute;es personnelles avec des annonceurs tiers.</li>
    </ul>
  </section>

  <section id="data" class="card">
    <h2>Donn&eacute;es que nous collectons</h2>

    <h3>Informations de compte</h3>
    <p>Lorsque vous vous connectez avec Google, Apple ou Facebook, nous recevons votre adresse e-mail, votre nom d'affichage, l'URL de votre avatar (si disponible) et un identifiant technique de compte. Ces informations sont utilis&eacute;es uniquement pour vous authentifier et s&eacute;curiser l'acc&egrave;s &agrave; l'application.</p>

    <h3>Donn&eacute;es de l'app (cloud)</h3>
    <p>Lorsque vous &ecirc;tes connect&eacute;, nous stockons les donn&eacute;es de l'application dans le cloud (Firebase Firestore), telles que les articles que vous cr&eacute;ez, les notes d'articles, les cat&eacute;gories/groupes et les m&eacute;tadonn&eacute;es associ&eacute;es (par exemple, les horodatages de cr&eacute;ation et de mise &agrave; jour). Cela permet le fonctionnement des fonctionnalit&eacute;s li&eacute;es au compte.</p>

    <h3>Donn&eacute;es de l'app (local)</h3>
    <p>Certaines donn&eacute;es de l'application sont &eacute;galement stock&eacute;es localement sur votre appareil pour des raisons de performance et d'utilisation hors ligne. Si vous vous d&eacute;connectez, d&eacute;sinstallez l'application ou utilisez les options de suppression int&eacute;gr&eacute;es, les donn&eacute;es locales peuvent &ecirc;tre supprim&eacute;es selon l'action effectu&eacute;e.</p>

    <h3>Donn&eacute;es de scan IA</h3>
    <p>Si vous utilisez la fonctionnalit&eacute; de scan IA, nous traitons le texte reconnu (OCR) &agrave; partir de la photo du produit pour g&eacute;n&eacute;rer des suggestions de remplissage automatique. L'application ne t&eacute;l&eacute;verse pas vos photos dans le cadre du scan IA.</p>

    <h3>Informations techniques</h3>
    <p>Nous pouvons stocker des m&eacute;tadonn&eacute;es techniques de base li&eacute;es &agrave; votre compte (par exemple, famille/mod&egrave;le de l'appareil et version d'iOS) afin de contribuer &agrave; la s&eacute;curit&eacute;, au d&eacute;bogage et au bon fonctionnement de l'application.</p>

    <h3>Rapports d'erreurs et de plantages</h3>
    <p>Nous utilisons Firebase Crashlytics (fourni par Google) pour collecter des rapports de plantage et des donn&eacute;es d'erreurs non fatales. Cela nous aide &agrave; identifier et corriger les probl&egrave;mes dans l'application. Les donn&eacute;es suivantes peuvent &ecirc;tre collect&eacute;es automatiquement lorsque l'application rencontre une erreur ou un plantage :</p>
    <ul>
      <li>Traces de pile de plantage et messages d'erreur (d&eacute;tails techniques sur la cause du probl&egrave;me).</li>
      <li>Mod&egrave;le de l'appareil, version du syst&egrave;me d'exploitation et m&eacute;moire disponible.</li>
      <li>&Eacute;tat de l'application au moment du plantage (par exemple, l'&eacute;cran en cours).</li>
      <li>Votre identifiant de compte (pour nous aider &agrave; examiner les probl&egrave;mes signal&eacute;s par des utilisateurs sp&eacute;cifiques).</li>
      <li>Journaux de fil d'Ariane — une s&eacute;quence limit&eacute;e d'&eacute;v&eacute;nements de l'application pr&eacute;c&eacute;dant le plantage.</li>
    </ul>
    <p>Ces donn&eacute;es sont utilis&eacute;es uniquement pour am&eacute;liorer la stabilit&eacute; de l'application et ne sont pas utilis&eacute;es &agrave; des fins publicitaires, de suivi ou de profilage. Les donn&eacute;es de plantage sont trait&eacute;es par Google conform&eacute;ment &agrave; ses conditions Firebase. Pour en savoir plus, consultez <a href="https://firebase.google.com/support/privacy" target="_blank" rel="noopener">Firebase Privacy</a>.</p>
  </section>

  <section id="use" class="card">
    <h2>Utilisation des donn&eacute;es</h2>
    <ul>
      <li>Authentifier votre compte et s&eacute;curiser les sessions.</li>
      <li>Stocker et afficher votre inventaire et vos notes associ&eacute;s &agrave; votre compte.</li>
      <li>Envoyer les notifications auxquelles vous avez souscrit (par exemple, rappels d'expiration).</li>
      <li>Traiter les requ&ecirc;tes de scan IA pour g&eacute;n&eacute;rer des suggestions de remplissage automatique (lorsque vous choisissez d'utiliser cette fonctionnalit&eacute;).</li>
      <li>Am&eacute;liorer la fiabilit&eacute; et les performances de l'application.</li>
    </ul>
    <p>Nous ne vendons pas vos donn&eacute;es. Nous ne lisons pas vos e-mails ni vos contacts.</p>
  </section>

  <section id="sharing" class="card">
    <h2>Partage</h2>
    <p>Nous ne partageons pas de donn&eacute;es personnelles avec des annonceurs tiers ou des courtiers en donn&eacute;es. Les prestataires de services ne traitent les donn&eacute;es qu'en notre nom, dans la mesure n&eacute;cessaire au fonctionnement de l'application.</p>
    <ul>
      <li>Google Firebase — authentification (Firebase Auth), stockage en base de donn&eacute;es cloud (Firestore), traitement backend (Cloud Functions) et rapports de plantage/erreurs (Crashlytics) n&eacute;cessaires au fonctionnement des fonctionnalit&eacute;s de compte et cloud et &agrave; l'am&eacute;lioration de la stabilit&eacute; de l'application.</li>
      <li>OpenAI — traite le texte OCR pour g&eacute;n&eacute;rer des suggestions de remplissage automatique lorsque vous utilisez la fonctionnalit&eacute; de scan IA.</li>
      <li>Apple — Sign in with Apple ; rapports de plantage anonymes (si vous avez activ&eacute; cette option sur votre appareil).</li>
      <li>Meta (Facebook) — authentification (Facebook Login).</li>
    </ul>
    <p>Nous pouvons divulguer des informations si la loi ou une proc&eacute;dure judiciaire l'exige, ou pour prot&eacute;ger nos droits, notre s&eacute;curit&eacute; ou nos biens. Nous pouvons utiliser des donn&eacute;es anonymis&eacute;es et agr&eacute;g&eacute;es &agrave; des fins d'analyse et d'am&eacute;lioration du produit, sans permettre de vous identifier.</p>
  </section>

  <section id="retention" class="card">
    <h2>Conservation</h2>
    <p>Les informations de compte et les donn&eacute;es de l'application stock&eacute;es dans le cloud (telles que les articles, les notes et les cat&eacute;gories/groupes) sont conserv&eacute;es tant que votre compte est actif. Vous pouvez demander la suppression de votre compte et des donn&eacute;es cloud associ&eacute;es en utilisant l'option de suppression de compte dans l'application (si disponible) ou en nous contactant.</p>
    <p>Les donn&eacute;es locales de l'application stock&eacute;es sur votre appareil sont conserv&eacute;es jusqu'&agrave; ce que vous les supprimiez, utilisiez les options de suppression int&eacute;gr&eacute;es, vous d&eacute;connectiez ou d&eacute;sinstalliez l'application.</p>
  </section>

  <section id="rights" class="card">
    <h2>Vos droits</h2>
    <p>Selon votre r&eacute;gion (UE/EEE/Royaume-Uni/Canada/&Eacute;tats-Unis), vous pouvez avoir le droit d'acc&eacute;der &agrave; vos donn&eacute;es, de les rectifier, de les supprimer ou de les exporter, et de retirer votre consentement le cas &eacute;ch&eacute;ant. Pour exercer ces droits, contactez-nous. Vous avez &eacute;galement le droit de d&eacute;poser une r&eacute;clamation aupr&egrave;s de l'autorit&eacute; portugaise de protection des donn&eacute;es (CNPD).</p>
  </section>

  <section id="children" class="card">
    <h2>Enfants</h2>
    <p>L'application ne s'adresse pas aux enfants de moins de 13 ans (ou de l'&acirc;ge minimum requis dans votre pays). Nous ne collectons pas sciemment de donn&eacute;es aupr&egrave;s d'enfants.</p>
  </section>

  <section id="changes" class="card">
    <h2>Modifications</h2>
    <p>Nous pouvons mettre &agrave; jour cette politique au fur et &agrave; mesure de l'&eacute;volution de l'application. Les modifications importantes seront signal&eacute;es sur cette page.</p>
  </section>

  <section id="legal" class="card">
    <h2>Responsable du traitement</h2>
    <p>L'application est d&eacute;velopp&eacute;e et exploit&eacute;e par un d&eacute;veloppeur ind&eacute;pendant bas&eacute; au Portugal. Contact : <a href="mailto:squirrelvault.tracker@gmail.com">squirrelvault.tracker@gmail.com</a>.</p>
    <p>Nous agissons en tant que responsable du traitement de vos donn&eacute;es. L'e-mail est suffisant pour nous contacter ; une adresse postale n'est pas requise &agrave; cet effet.</p>
  </section>

  <section id="medical" class="card">
    <h2>Avertissement m&eacute;dical</h2>
    <p>L'application peut afficher ou vous permettre de suivre des articles tels que des aliments, des compl&eacute;ments alimentaires ou des m&eacute;dicaments. L'application n'est pas un dispositif m&eacute;dical et ne fournit pas de conseils m&eacute;dicaux, de diagnostic ou de traitement. Consultez toujours un professionnel de sant&eacute; qualifi&eacute;. L'utilisation de l'application se fait &agrave; vos propres risques.</p>
  </section>

  <section id="cookies" class="card">
    <h2>Cookies</h2>
    <p>Ce site de support est h&eacute;berg&eacute; sur GitHub Pages. Nous n'utilisons pas de cookies ni de traceurs ici. Si nous ajoutons des outils d'analyse &agrave; l'avenir, nous mettrons &agrave; jour cette politique.</p>
  </section>

  <section id="liability-note" class="card">
    <h2>Avertissement et responsabilit&eacute;</h2>
    <p>Cette politique de confidentialit&eacute; est fournie par souci de transparence. Elle ne cr&eacute;e aucune garantie. L'application est fournie « en l'&eacute;tat ». La responsabilit&eacute; est limit&eacute;e comme d&eacute;crit dans les conditions d'utilisation. Votre seul recours en cas de probl&egrave;me est de cesser d'utiliser l'application et, le cas &eacute;ch&eacute;ant, de demander un remboursement aupr&egrave;s du magasin d'achat conform&eacute;ment &agrave; ses politiques.</p>
  </section>

  <section id="contact" class="card">
    <h2>Contact</h2>
    <p>E-mail : <a href="mailto:squirrelvault.tracker@gmail.com">squirrelvault.tracker@gmail.com</a></p>
  </section>

  <footer>
    <span class="pill">&copy; <span id="y"></span> SquirrelVault Tracker</span>
    <span class="pill"><a href="./terms-fr.html">Conditions</a></span>  </footer>
</main>
<script>document.getElementById('y').textContent = new Date().getFullYear();</script>
</body>
</html>
