<!DOCTYPE html>
<html lang="de">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width,initial-scale=1" />
<title>Datenschutzrichtlinie — SquirrelVault Tracker</title>
<meta name="description" content="Datenschutzrichtlinie für SquirrelVault Tracker." />
<link rel="icon" type="image/png" href="./squirrelvault-icon.png" />
<link rel="apple-touch-icon" href="./squirrelvault-icon.png" />
<meta property="og:title" content="Datenschutzrichtlinie — SquirrelVault Tracker" />
<meta property="og:description" content="Wie wir mit Ihren Daten umgehen: Kontoinformationen, Cloud-Speicherung für Artikel/Notizen, AI-Scan-OCR-Verarbeitung, keine Werbung, kein Datenverkauf." />
<meta property="og:image" content="https://squirrel-app.github.io/SquirrelVault-Tracker-Support/squirrelvault-icon.png" />
<meta property="og:type" content="website" />
<meta name="twitter:card" content="summary_large_image" />
<style>

  :root {
    --bg: #FFF7EF;
    --fg: #2B2B2B;
    --muted: #6B6B6B;
    --card: #FFFFFF;
    --border: #F2E6DA;
    --accent: #FFA74A;
    --accent-strong: #FF8C1F;
    --link: var(--accent);
    --shadow: 0 6px 24px rgba(255,140,31,.15);
    --radius: 18px;
  }
  @media (prefers-color-scheme: dark) {
    :root {
      --bg: #19130E;
      --fg: #EFE9E3;
      --muted: #B7ADA6;
      --card: #231A13;
      --border: #3B2C20;
      --accent: #FF9E3A;
      --accent-strong: #FFB25E;
      --link: var(--accent);
      --shadow: 0 8px 28px rgba(255,158,58,.18);
    }
  }
  * { box-sizing: border-box; }
  html { scroll-behavior: smooth; }
  body { margin: 0; font: 16px/1.65 system-ui,-apple-system,Segoe UI,Inter,Roboto,Arial,sans-serif; background: var(--bg); color: var(--fg); }
  .wrap { max-width: 960px; margin: 0 auto; padding: 40px 20px 80px; }
  header { margin-bottom: 24px; }
  .brand { display: flex; align-items: center; gap: 12px; margin-bottom: 10px; }
  .logo {
    width: 40px; height: 40px; border-radius: 12px;
    background: linear-gradient(135deg, var(--accent), var(--accent-strong));
    box-shadow: var(--shadow);
    display: flex; align-items: center; justify-content: center;
    color: white; font-weight: 800; font-size: 18px; letter-spacing: .5px;
    overflow: hidden;
  }
  .logo img { width: 100%; height: 100%; border-radius: 12px; }
  h1 { font-size: 1.9rem; margin: 0; }
  .sub { color: var(--muted); font-size: .95rem; margin-top: 6px; }
  nav.toc a { display: inline-block; margin: 4px 12px 4px 0; color: var(--link); text-decoration: none; padding:6px 10px; border:1px solid var(--border); border-radius:999px; }
  nav.toc a:hover { text-decoration: none; background: rgba(0,0,0,.03); }
  .card {
    background: var(--card);
    border: 1px solid var(--border);
    border-radius: var(--radius);
    box-shadow: var(--shadow);
    padding: 22px;
    margin: 18px 0;
  }
  h2 { font-size: 1.25rem; margin: 26px 0 10px; }
  h3 { font-size: 1.05rem; margin: 22px 0 10px; }
  a { color: var(--link); text-decoration: none; }
  a:hover { text-decoration: underline; }
  ul { padding-left: 20px; }
  details summary { cursor: pointer; font-weight: 700; }
  .grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(280px, 1fr)); gap: 16px; }
  .btn { display:inline-block; padding:10px 14px; border-radius:12px; border:1px solid var(--border); text-decoration:none; background: var(--card); }
  .btn:hover { background: rgba(0,0,0,.03); }
  footer { margin-top: 36px; color: var(--muted); font-size: .9rem; display:flex; gap:12px; flex-wrap:wrap; align-items:center; }
  .pill { border:1px solid var(--border); border-radius:999px; padding:6px 10px; }
  :target { outline: 2px solid var(--accent); outline-offset: 6px; border-radius: 14px; }

  .lang-bar { display: flex; gap: 6px; flex-wrap: wrap; align-items: center; margin-top: 8px; font-size: .85rem; }
  .lang-bar a, .lang-bar strong { padding: 3px 8px; border: 1px solid var(--border); border-radius: 999px; color: var(--link); text-decoration: none; }
  .lang-bar strong { background: var(--accent); color: #fff; border-color: var(--accent); }
  .lang-bar a:hover { background: rgba(0,0,0,.03); text-decoration: none; }

</style>
</head>
<body>
<main class="wrap">
  <header>
    <div class="brand">
      <div class="logo"><img src="squirrelvault-icon.png" alt="SquirrelVault Tracker Logo"></div>
      <div>
        <h1>Datenschutzrichtlinie</h1>
        <div class="sub">Aktualisiert am <time datetime="2026-02-23">23. Feb. 2026</time></div>
      </div>
    </div>
    <nav class="toc">
      <a href="./index.html">&larr; Zur&uuml;ck zum Support</a>
      <a href="#summary">Zusammenfassung</a>
      <a href="#data">Daten die wir erheben</a>
      <a href="#use">Datenverwendung</a>
      <a href="#sharing">Weitergabe</a>
      <a href="#rights">Ihre Rechte</a>
      <a href="#contact">Kontakt</a>
    </nav>
    <div class="lang-bar">
      <a href="./privacy.html">EN</a>
      <strong>DE</strong>
      <a href="./privacy-es.html">ES</a>
      <a href="./privacy-fr.html">FR</a>
      <a href="./privacy-it.html">IT</a>
      <a href="./privacy-nl.html">NL</a>
      <a href="./privacy-pl.html">PL</a>
      <a href="./privacy-pt.html">PT</a>
      <a href="./privacy-uk.html">UK</a>
    </div>
  </header>

  <section id="summary" class="card">
    <h2>Zusammenfassung</h2>
    <ul>
      <li>Wir erheben die minimal notwendigen Kontoinformationen von Ihrem Anmeldeanbieter (Google, Apple oder Facebook): E-Mail-Adresse, Anzeigename, Profilbild (falls vorhanden) und eine technische Konto-ID.</li>
      <li>Ihre Bestandsdaten (Artikel) und Notizen sowie Kategorien/Gruppen k&ouml;nnen in der Cloud (Firebase Firestore) gespeichert werden, um kontobasierte Funktionen zu unterst&uuml;tzen.</li>
      <li>Wenn Sie den AI-Scan verwenden, verarbeiten wir erkannten Text (OCR), um Vorschl&auml;ge zum automatischen Ausf&uuml;llen zu erstellen. Die App l&auml;dt Ihre Fotos im Rahmen des AI-Scans nicht hoch.</li>
      <li>Keine Werbung und kein Datenverkauf. Wir geben keine personenbezogenen Daten an Drittvermarkter weiter.</li>
    </ul>
  </section>

  <section id="data" class="card">
    <h2>Daten die wir erheben</h2>

    <h3>Kontoinformationen</h3>
    <p>Wenn Sie sich mit Google, Apple oder Facebook anmelden, erhalten wir Ihre E-Mail-Adresse, Ihren Anzeigenamen, Ihre Profilbild-URL (falls verf&uuml;gbar) und eine technische Konto-ID. Diese Daten werden ausschlie&szlig;lich zur Authentifizierung und zur Sicherung des Zugangs zur App verwendet.</p>

    <h3>App-Daten (Cloud)</h3>
    <p>Wenn Sie angemeldet sind, speichern wir App-Daten in der Cloud (Firebase Firestore), wie z.&nbsp;B. von Ihnen erstellte Artikel, Artikelnotizen, Kategorien/Gruppen und zugeh&ouml;rige Metadaten (z.&nbsp;B. Erstellungs- und Aktualisierungszeitstempel). Dies dient dem Betrieb kontobasierter Funktionen.</p>

    <h3>App-Daten (lokal)</h3>
    <p>Einige App-Daten werden auch lokal auf Ihrem Ger&auml;t gespeichert, um die Leistung und die Offline-Nutzung zu erm&ouml;glichen. Wenn Sie sich abmelden, die App deinstallieren oder In-App-L&ouml;schoptionen verwenden, k&ouml;nnen lokale Daten je nach Aktion entfernt werden.</p>

    <h3>AI-Scan-Daten</h3>
    <p>Wenn Sie die AI-Scan-Funktion verwenden, verarbeiten wir erkannten Text (OCR) aus dem Produktfoto, um Vorschl&auml;ge zum automatischen Ausf&uuml;llen zu erstellen. Die App l&auml;dt Ihre Fotos im Rahmen des AI-Scans nicht hoch.</p>

    <h3>Ger&auml;te- und technische Informationen</h3>
    <p>Wir k&ouml;nnen grundlegende technische Metadaten speichern, die mit Ihrem Konto verkn&uuml;pft sind (z.&nbsp;B. Ger&auml;tefamilie/-modell und iOS-Version), um die Sicherheit, Fehlersuche und den zuverl&auml;ssigen Betrieb der App zu unterst&uuml;tzen.</p>

    <h3>Absturz- und Fehlerberichte</h3>
    <p>Wir verwenden Firebase Crashlytics (bereitgestellt von Google), um Absturzberichte und nicht-fatale Fehlerdaten zu erfassen. Dies hilft uns, Probleme in der App zu identifizieren und zu beheben. Die folgenden Daten k&ouml;nnen automatisch erfasst werden, wenn in der App ein Fehler oder Absturz auftritt:</p>
    <ul>
      <li>Absturz-Stack-Traces und Fehlermeldungen (technische Details zu dem aufgetretenen Problem).</li>
      <li>Ger&auml;temodell, Betriebssystemversion und verf&uuml;gbarer Speicher.</li>
      <li>Anwendungszustand zum Zeitpunkt des Absturzes (z.&nbsp;B. aktueller Bildschirm).</li>
      <li>Ihre Kontokennung (um uns bei der Untersuchung von Problemen zu helfen, die von bestimmten Nutzern gemeldet werden).</li>
      <li>Breadcrumb-Protokolle &mdash; eine begrenzte Abfolge von App-Ereignissen vor dem Absturz.</li>
    </ul>
    <p>Diese Daten werden ausschlie&szlig;lich zur Verbesserung der Stabilit&auml;t der App verwendet und nicht f&uuml;r Werbung, Tracking oder Profilerstellung eingesetzt. Absturzdaten werden von Google gem&auml;&szlig; den Firebase-Bedingungen verarbeitet. Weitere Informationen finden Sie unter <a href="https://firebase.google.com/support/privacy" target="_blank" rel="noopener">Firebase Datenschutz</a>.</p>
  </section>

  <section id="use" class="card">
    <h2>Datenverwendung</h2>
    <ul>
      <li>Authentifizierung Ihres Kontos und Sicherung der Sitzungen.</li>
      <li>Speicherung und Anzeige Ihres Bestands und Ihrer Notizen, die mit Ihrem Konto verkn&uuml;pft sind.</li>
      <li>Versand von Benachrichtigungen, f&uuml;r die Sie sich entschieden haben (z.&nbsp;B. Ablauferinnerungen).</li>
      <li>Verarbeitung von AI-Scan-Anfragen zur Erstellung von Vorschl&auml;gen zum automatischen Ausf&uuml;llen (wenn Sie diese Funktion nutzen).</li>
      <li>Verbesserung der Zuverl&auml;ssigkeit und Leistung der App.</li>
    </ul>
    <p>Wir verkaufen Ihre Daten nicht. Wir lesen weder Ihre E-Mails noch Ihre Kontakte.</p>
  </section>

  <section id="sharing" class="card">
    <h2>Weitergabe</h2>
    <p>Wir geben keine personenbezogenen Daten an Drittanbieter von Werbung oder Datenvermittler weiter. Dienstleister verarbeiten Daten nur in unserem Auftrag, soweit dies f&uuml;r den Betrieb der App erforderlich ist.</p>
    <ul>
      <li>Google Firebase &mdash; Authentifizierung (Firebase Auth), Cloud-Datenbankspeicherung (Firestore), Backend-Verarbeitung (Cloud Functions) und Absturz-/Fehlerberichterstattung (Crashlytics), die f&uuml;r den Betrieb der Konto- und Cloud-Funktionen sowie zur Verbesserung der App-Stabilit&auml;t erforderlich sind.</li>
      <li>OpenAI &mdash; verarbeitet OCR-Text zur Erstellung von Vorschl&auml;gen zum automatischen Ausf&uuml;llen, wenn Sie die AI-Scan-Funktion verwenden.</li>
      <li>Apple &mdash; Anmeldung mit Apple; anonyme Absturzberichte (sofern Sie dies auf Ihrem Ger&auml;t aktiviert haben).</li>
      <li>Meta (Facebook) &mdash; Authentifizierung (Facebook Login).</li>
    </ul>
    <p>Wir k&ouml;nnen Informationen offenlegen, wenn dies gesetzlich oder durch ein rechtliches Verfahren vorgeschrieben ist, oder um unsere Rechte, Sicherheit oder unser Eigentum zu sch&uuml;tzen. Wir k&ouml;nnen anonymisierte, aggregierte Daten f&uuml;r Analysen und Produktverbesserungen verwenden, die keinen R&uuml;ckschluss auf Ihre Person zulassen.</p>
  </section>

  <section id="retention" class="card">
    <h2>Aufbewahrung</h2>
    <p>Kontoinformationen und in der Cloud gespeicherte App-Daten (wie Artikel, Notizen und Kategorien/Gruppen) werden aufbewahrt, solange Ihr Konto aktiv ist. Sie k&ouml;nnen die L&ouml;schung Ihres Kontos und der zugeh&ouml;rigen Cloud-Daten &uuml;ber die In-App-Option zur Kontol&ouml;schung (falls verf&uuml;gbar) oder durch Kontaktaufnahme mit uns beantragen.</p>
    <p>Lokale App-Daten, die auf Ihrem Ger&auml;t gespeichert sind, verbleiben dort, bis Sie sie l&ouml;schen, In-App-L&ouml;schoptionen verwenden, sich abmelden oder die App deinstallieren.</p>
  </section>

  <section id="rights" class="card">
    <h2>Ihre Rechte</h2>
    <p>Abh&auml;ngig von Ihrer Region (EU/EWR/UK/Kanada/USA) haben Sie m&ouml;glicherweise das Recht auf Zugang, Berichtigung, L&ouml;schung oder Export Ihrer Daten sowie auf Widerruf der Einwilligung, sofern zutreffend. Um diese Rechte auszu&uuml;ben, kontaktieren Sie uns. Sie haben au&szlig;erdem das Recht, eine Beschwerde bei der portugiesischen Datenschutzbeh&ouml;rde (CNPD) einzureichen.</p>
  </section>

  <section id="children" class="card">
    <h2>Kinder</h2>
    <p>Die App richtet sich nicht an Kinder unter 13 Jahren (oder dem in Ihrem Land vorgeschriebenen Mindestalter). Wir erheben wissentlich keine Daten von Kindern.</p>
  </section>

  <section id="changes" class="card">
    <h2>&Auml;nderungen dieser Richtlinie</h2>
    <p>Wir k&ouml;nnen diese Richtlinie aktualisieren, wenn sich die App weiterentwickelt. Wesentliche &Auml;nderungen werden auf dieser Seite hervorgehoben.</p>
  </section>

  <section id="legal" class="card">
    <h2>Verantwortlicher</h2>
    <p>Die App wird von einem unabh&auml;ngigen Entwickler mit Sitz in Portugal entwickelt und betrieben. Kontakt: <a href="mailto:squirrelvault.tracker@gmail.com">squirrelvault.tracker@gmail.com</a>.</p>
    <p>Wir handeln als Verantwortlicher f&uuml;r Ihre Daten. Eine Kontaktaufnahme per E-Mail ist ausreichend; eine Postanschrift ist f&uuml;r diesen Zweck nicht erforderlich.</p>
  </section>

  <section id="medical" class="card">
    <h2>Medizinischer Haftungsausschluss</h2>
    <p>Die App kann Artikel wie Lebensmittel, Nahrungserg&auml;nzungsmittel oder Medikamente anzeigen oder Ihnen deren Verfolgung erm&ouml;glichen. Die App ist kein Medizinprodukt und bietet keine medizinische Beratung, Diagnose oder Behandlung. Konsultieren Sie stets einen qualifizierten Gesundheitsexperten. Die Nutzung der App erfolgt auf eigenes Risiko.</p>
  </section>

  <section id="cookies" class="card">
    <h2>Cookies</h2>
    <p>Diese Support-Website wird auf GitHub Pages gehostet. Wir verwenden hier keine Cookies oder Tracker. Sollten wir in Zukunft Analysedienste hinzuf&uuml;gen, werden wir diese Richtlinie entsprechend aktualisieren.</p>
  </section>

  <section id="liability-note" class="card">
    <h2>Haftungsausschluss</h2>
    <p>Diese Datenschutzrichtlinie dient der Transparenz. Sie begr&uuml;ndet keine Garantien. Die App wird ohne M&auml;ngelgew&auml;hr bereitgestellt. Die Haftung ist wie in den Nutzungsbedingungen beschrieben beschr&auml;nkt. Ihr einziger Rechtsbehelf bei Problemen besteht darin, die Nutzung der App einzustellen und gegebenenfalls eine R&uuml;ckerstattung &uuml;ber den Kaufort gem&auml;&szlig; dessen Richtlinien zu beantragen.</p>
  </section>

  <section id="contact" class="card">
    <h2>Kontakt</h2>
    <p>E-Mail: <a href="mailto:squirrelvault.tracker@gmail.com">squirrelvault.tracker@gmail.com</a></p>
  </section>

  <footer>
    <span class="pill">&copy; <span id="y"></span> SquirrelVault Tracker</span>
    <span class="pill"><a href="./terms-de.html">Nutzungsbedingungen</a></span>  </footer>
</main>
<script>document.getElementById('y').textContent = new Date().getFullYear();</script>
</body>
</html>
