<!DOCTYPE html>
<html lang="de">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width,initial-scale=1" />
<title>Nutzungsbedingungen / EULA — SquirrelVault Tracker</title>
<meta name="description" content="Nutzungsbedingungen / Endbenutzer-Lizenzvereinbarung f&uuml;r SquirrelVault Tracker." />
<link rel="icon" type="image/png" href="./squirrelvault-icon.png" />
<link rel="apple-touch-icon" href="./squirrelvault-icon.png" />
<meta property="og:title" content="Nutzungsbedingungen / EULA — SquirrelVault Tracker" />
<meta property="og:description" content="Ihre Lizenz zur Nutzung von SquirrelVault Tracker und die geltenden Bedingungen." />
<meta property="og:image" content="https://squirrel-app.github.io/SquirrelVault-Tracker-Support/squirrelvault-icon.png" />
<meta property="og:type" content="website" />
<meta name="twitter:card" content="summary_large_image" />
<style>

  :root {
    --bg: #FFF7EF;
    --fg: #2B2B2B;
    --muted: #6B6B6B;
    --card: #FFFFFF;
    --border: #F2E6DA;
    --accent: #FFA74A;
    --accent-strong: #FF8C1F;
    --link: var(--accent);
    --shadow: 0 6px 24px rgba(255,140,31,.15);
    --radius: 18px;
  }
  @media (prefers-color-scheme: dark) {
    :root {
      --bg: #19130E;
      --fg: #EFE9E3;
      --muted: #B7ADA6;
      --card: #231A13;
      --border: #3B2C20;
      --accent: #FF9E3A;
      --accent-strong: #FFB25E;
      --link: var(--accent);
      --shadow: 0 8px 28px rgba(255,158,58,.18);
    }
  }
  * { box-sizing: border-box; }
  html { scroll-behavior: smooth; }
  body { margin: 0; font: 16px/1.65 system-ui,-apple-system,Segoe UI,Inter,Roboto,Arial,sans-serif; background: var(--bg); color: var(--fg); }
  .wrap { max-width: 960px; margin: 0 auto; padding: 40px 20px 80px; }
  header { margin-bottom: 24px; }
  .brand { display: flex; align-items: center; gap: 12px; margin-bottom: 10px; }
  .logo {
    width: 40px; height: 40px; border-radius: 12px;
    background: linear-gradient(135deg, var(--accent), var(--accent-strong));
    box-shadow: var(--shadow);
    display: flex; align-items: center; justify-content: center;
    color: white; font-weight: 800; font-size: 18px; letter-spacing: .5px;
    overflow: hidden;
  }
  .logo img { width: 100%; height: 100%; border-radius: 12px; }
  h1 { font-size: 1.9rem; margin: 0; }
  .sub { color: var(--muted); font-size: .95rem; margin-top: 6px; }
  nav.toc a { display: inline-block; margin: 4px 12px 4px 0; color: var(--link); text-decoration: none; padding:6px 10px; border:1px solid var(--border); border-radius:999px; }
  nav.toc a:hover { text-decoration: none; background: rgba(0,0,0,.03); }
  .card {
    background: var(--card);
    border: 1px solid var(--border);
    border-radius: 18px;
    box-shadow: var(--shadow);
    padding: 22px;
    margin: 18px 0;
  }
  h2 { font-size: 1.25rem; margin: 26px 0 10px; }
  h3 { font-size: 1.05rem; margin: 22px 0 10px; }
  a { color: var(--link); text-decoration: none; }
  a:hover { text-decoration: underline; }
  ul { padding-left: 20px; }
  footer { margin-top: 36px; color: var(--muted); font-size: .9rem; display:flex; gap:12px; flex-wrap:wrap; align-items:center; }
  .pill { border:1px solid var(--border); border-radius:999px; padding:6px 10px; }
  :target { outline: 2px solid var(--accent); outline-offset: 6px; border-radius: 14px; }

  .lang-bar { display: flex; gap: 6px; flex-wrap: wrap; align-items: center; margin-top: 8px; font-size: .85rem; }
  .lang-bar a, .lang-bar strong { padding: 3px 8px; border: 1px solid var(--border); border-radius: 999px; color: var(--link); text-decoration: none; }
  .lang-bar strong { background: var(--accent); color: #fff; border-color: var(--accent); }
  .lang-bar a:hover { background: rgba(0,0,0,.03); text-decoration: none; }

</style>
</head>
<body>
<main class="wrap">
  <header>
    <div class="brand">
      <div class="logo"><img src="squirrelvault-icon.png" alt="SquirrelVault Tracker Logo"></div>
      <div>
        <h1>Nutzungsbedingungen / EULA</h1>
        <div class="sub">Aktualisiert am <time datetime="2026-02-23">23. Feb. 2026</time></div>
      </div>
    </div>
    <nav class="toc">
      <a href="./index.html">&larr; Zur&uuml;ck zum Support</a>
      <a href="#license">Lizenz</a>
      <a href="#accounts">Konten</a>
      <a href="#use">Zul&auml;ssige Nutzung</a>
      <a href="#pro">Abonnements &amp; Pro</a>
      <a href="#ai">KI-Funktionen</a>
      <a href="#cloud">Cloud-Daten</a>
      <a href="#analytics">Analyse</a>
      <a href="#ownership">Eigentum</a>
      <a href="#warranty">Haftungsausschluss</a>
      <a href="#liability">Haftungsbeschr&auml;nkung</a>
      <a href="#termination">K&uuml;ndigung</a>
      <a href="#general">Allgemeines</a>
      <a href="#contact">Kontakt</a>
    </nav>
    <div class="lang-bar">
      <a href="./terms.html">EN</a>
      <strong>DE</strong>
      <a href="./terms-es.html">ES</a>
      <a href="./terms-fr.html">FR</a>
      <a href="./terms-it.html">IT</a>
      <a href="./terms-nl.html">NL</a>
      <a href="./terms-pl.html">PL</a>
      <a href="./terms-pt.html">PT</a>
      <a href="./terms-uk.html">UK</a>
    </div>
  </header>

  <section id="intro" class="card">
    <p>Diese Nutzungsbedingungen / Endbenutzer-Lizenzvereinbarung (zusammenfassend &bdquo;Bedingungen&ldquo;) stellen eine rechtliche Vereinbarung zwischen Ihnen und dem Anbieter der Anwendung (&bdquo;wir&ldquo;, &bdquo;uns&ldquo;) dar, die Ihre Nutzung der iOS-Anwendung SquirrelVault Tracker (&bdquo;App&ldquo;) regelt. Durch die Installation oder Nutzung der App stimmen Sie diesen Bedingungen zu.</p>
  </section>

  <section id="license" class="card">
    <h2>Lizenz</h2>
    <p>Wir gew&auml;hren Ihnen eine eingeschr&auml;nkte, nicht-exklusive, nicht &uuml;bertragbare, widerrufliche Lizenz zur Nutzung der App auf Apple-Ger&auml;ten, die Sie besitzen oder kontrollieren, wie es die App Store-Bedingungen und Nutzungsregeln gestatten.</p>
  </section>

  <section id="accounts" class="card">
    <h2>Konten &amp; Zugang</h2>
    <p>F&uuml;r den Zugriff auf einige oder alle Funktionen der App kann eine Anmeldung erforderlich sein (z.&nbsp;B. &uuml;ber Google, Apple oder Facebook). Sie sind f&uuml;r die Sicherheit Ihres Ger&auml;ts und Ihres Kontos verantwortlich. Sie m&uuml;ssen rechtlich berechtigt sein, die App an Ihrem Standort zu nutzen.</p>
  </section>

  <section id="use" class="card">
    <h2>Zul&auml;ssige Nutzung</h2>
    <ul>
      <li>Missbrauchen Sie die App nicht und beeintr&auml;chtigen Sie nicht ihren Betrieb.</li>
      <li>Versuchen Sie nicht, die App zu dekompilieren, zu reverse-engineeren oder Sicherheitsfunktionen zu umgehen, es sei denn, dies ist gesetzlich gestattet.</li>
      <li>Laden Sie keine rechtswidrigen Inhalte oder Inhalte hoch, die die Rechte anderer verletzen.</li>
    </ul>
  </section>

  <section id="pro" class="card">
    <h2>Abonnements &amp; Pro</h2>
    <p>Die App kann optionale kostenpflichtige Abonnements anbieten (zum Beispiel &bdquo;Pro&ldquo;), die zus&auml;tzliche Funktionen oder h&ouml;here Limits freischalten. Verf&uuml;gbare Pl&auml;ne, Preise und Vorteile werden zum Zeitpunkt des Kaufs in der App angezeigt.</p>

    <h3>Abrechnung &amp; Verl&auml;ngerung</h3>
    <ul>
      <li>Abonnements werden &uuml;ber Ihr Apple-ID-Konto im App Store abgerechnet.</li>
      <li>Abonnements verl&auml;ngern sich automatisch, sofern Sie nicht mindestens 24 Stunden vor Ende des aktuellen Zeitraums k&uuml;ndigen.</li>
      <li>Ihrem Apple-ID-Konto wird die Verl&auml;ngerung innerhalb von 24 Stunden vor Ende des aktuellen Zeitraums berechnet.</li>
      <li>Sie k&ouml;nnen Ihr Abonnement nach dem Kauf in den Einstellungen Ihres App Store-Kontos verwalten oder k&uuml;ndigen.</li>
    </ul>

    <h3>R&uuml;ckerstattungen</h3>
    <p>Zahlungen und R&uuml;ckerstattungen werden von Apple gem&auml;&szlig; den App Store-Richtlinien abgewickelt. Wir verarbeiten keine Zahlungen direkt.</p>

    <h3>Limits &amp; &Auml;nderungen</h3>
    <p>Wir k&ouml;nnen angemessene Nutzungslimits festlegen, um den Dienst zu sch&uuml;tzen (zum Beispiel monatliche Limits f&uuml;r AI-Scans). Limits k&ouml;nnen je nach Plan variieren und sich im Laufe der Zeit &auml;ndern. Wesentliche &Auml;nderungen werden in der App oder auf der Support-Seite kommuniziert.</p>
  </section>

  <section id="ai" class="card">
    <h2>KI-Funktionen</h2>
    <p>Die App kann KI-gest&uuml;tzte Funktionen enthalten (zum Beispiel AI-Scan/automatisches Ausf&uuml;llen). KI-Ausgaben k&ouml;nnen ungenau oder unvollst&auml;ndig sein, und Sie sind daf&uuml;r verantwortlich, Informationen zu &uuml;berpr&uuml;fen, bevor Sie sich darauf verlassen.</p>
    <p>Sie verpflichten sich, KI-Funktionen nicht f&uuml;r rechtswidrige Zwecke zu verwenden oder den Dienst zu missbrauchen, auszulesen oder zu &uuml;berlasten.</p>
  </section>

  <section id="cloud" class="card">
    <h2>Cloud-Daten</h2>
    <p>Wenn Sie angemeldet sind, kann die App bestimmte App-Daten in der Cloud speichern, um kontobasierte Funktionen zu betreiben, wie z.&nbsp;B. von Ihnen erstellte Bestandsartikel, Artikelnotizen und Kategorien/Gruppen. Die App l&auml;dt Ihre Fotos nicht hoch, sofern dies nicht ausdr&uuml;cklich in der App angegeben ist.</p>
    <p>Wir k&ouml;nnen den Zugang zu Cloud-Funktionen einschr&auml;nken, wenn dies aus Sicherheitsgr&uuml;nden, zu Wartungszwecken oder zur Verhinderung von Missbrauch erforderlich ist.</p>
  </section>

  <section id="analytics" class="card">
    <h2>Analyse &amp; Absturzberichte</h2>
    <p>Die App verwendet Firebase Crashlytics, um Absturzberichte und nicht-fatale Fehlerdaten zu erfassen. Diese Daten werden verwendet, um Fehler zu identifizieren und zu beheben, die Stabilit&auml;t zu verbessern und die Benutzererfahrung zu optimieren. Absturzdaten k&ouml;nnen Ger&auml;teinformationen, den App-Zustand und technische Fehlerdetails umfassen. Weitere Informationen finden Sie in unserer <a href="./privacy.html">Datenschutzrichtlinie</a>.</p>
    <p>Durch die Nutzung der App nehmen Sie zur Kenntnis, dass Absturz- und Fehlerdaten automatisch erfasst werden k&ouml;nnen, um den Dienst zu pflegen und zu verbessern.</p>
  </section>

  <section id="ownership" class="card">
    <h2>Eigentum &amp; Inhalte</h2>
    <p>Die App und ihre Inhalte sind Eigentum von uns oder unseren Lizenzgebern und durch Gesetze zum Schutz des geistigen Eigentums gesch&uuml;tzt. Sie behalten das Eigentum an den Daten, die Sie in der App erstellen.</p>
  </section>

  <section id="warranty" class="card">
    <h2>Haftungsausschluss</h2>
    <p>Die App wird ohne M&auml;ngelgew&auml;hr und ohne jegliche Garantien bereitgestellt. Wir garantieren nicht, dass die App unterbrechungsfrei oder fehlerfrei funktioniert oder dass M&auml;ngel behoben werden.</p>
  </section>

  <section id="liability" class="card">
    <h2>Haftungsbeschr&auml;nkung</h2>
    <p>Im gr&ouml;&szlig;tm&ouml;glichen gesetzlich zul&auml;ssigen Umfang haften wir nicht f&uuml;r indirekte, zuf&auml;llige, besondere, Folge-, beispielhafte oder Strafsch&auml;den oder f&uuml;r Nutzungs-, Daten- oder Gewinnverluste, die sich aus oder im Zusammenhang mit der App ergeben.</p>
    <p>Soweit die Haftung nicht ausgeschlossen werden kann, ist unsere Gesamthaftung im Rahmen dieser Bedingungen auf den h&ouml;heren der folgenden Betr&auml;ge beschr&auml;nkt: (a) den Betrag, den Sie (gegebenenfalls) f&uuml;r den Kauf der App gezahlt haben, oder (b) die Geb&uuml;hren, die Sie uns f&uuml;r In-App-K&auml;ufe oder Abonnements in den zw&ouml;lf (12) Monaten vor dem Ereignis, das den Anspruch begr&uuml;ndet, gezahlt haben. Haben Sie keine solchen Zahlungen geleistet, betr&auml;gt diese Obergrenze null (0), vorbehaltlich etwaiger gesetzlich vorgeschriebener R&uuml;ckerstattungen.</p>
    <p>Ihr einziger und ausschlie&szlig;licher Rechtsbehelf bei Problemen mit der App besteht darin, die Nutzung der App einzustellen und gegebenenfalls eine R&uuml;ckerstattung beim Kaufort gem&auml;&szlig; dessen Richtlinien zu beantragen.</p>
  </section>

  <section id="termination" class="card">
    <h2>K&uuml;ndigung</h2>
    <p>Sie k&ouml;nnen die Nutzung der App jederzeit einstellen. Wir k&ouml;nnen den Zugang aussetzen oder beenden, wenn Sie gegen diese Bedingungen versto&szlig;en.</p>
    <p>Sie k&ouml;nnen Ihr Konto in der App l&ouml;schen (falls verf&uuml;gbar). Wenn Sie Ihr Konto l&ouml;schen, werden wir die zugeordneten Cloud-Daten im erforderlichen und technisch machbaren Umfang entfernen oder anonymisieren. Lokale Daten, die auf Ihrem Ger&auml;t gespeichert sind, k&ouml;nnen in der App gel&ouml;scht (falls verf&uuml;gbar) oder durch Deinstallation der App entfernt werden.</p>
  </section>

  <section id="general" class="card">
    <h2>Allgemeines</h2>
    <p>Diese Bedingungen unterliegen dem Recht Portugals. Ihre zwingenden Verbraucherschutzrechte nach den Gesetzen Ihres Wohnsitzlandes bleiben unber&uuml;hrt. Sollte eine Bestimmung f&uuml;r nicht durchsetzbar befunden werden, bleiben die &uuml;brigen Bestimmungen in Kraft. Wir k&ouml;nnen diese Bedingungen aktualisieren; wesentliche &Auml;nderungen werden in der App oder auf der Support-Seite hervorgehoben.</p>
    <p>Nichts in diesen Bedingungen schlie&szlig;t die Haftung aus oder beschr&auml;nkt sie, soweit ein solcher Ausschluss oder eine solche Beschr&auml;nkung gesetzlich nicht zul&auml;ssig ist.</p>
  </section>

  <section id="contact" class="card">
    <h2>Kontakt</h2>
    <p>E-Mail: <a href="mailto:squirrelvault.tracker@gmail.com">squirrelvault.tracker@gmail.com</a></p>
  </section>

  <footer>
    <span class="pill">&copy; <span id="y"></span> SquirrelVault Tracker</span>
    <span class="pill"><a href="./privacy-de.html">Datenschutz</a></span>  </footer>
</main>
<script>document.getElementById('y').textContent = new Date().getFullYear();</script>
</body>
</html>
